<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"57b434f4ff0d141f20c6e41cac91a3af3501df2e0cfdeeb2f291829b38943d4e","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1288 at https://github.com/cal-itp/data-infra/actions/runs/20761746764","plan_out_hash":"782cf0e89565b0ea55f5cf00fd76c78b6a6a65950479d7cda63c5bf3dd5cb52f","plan_hash":"79ebe570743140519df9dec3fe19affe97086510e00691924e2b3bcbad9a8ae1","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "L+L99g==" -> (known after apply)
!~      detect_md5hash      = "zWkETEGcMVY2Qq7f5Nehqw==" -> "different hash"
!~      generation          = 1767728565969865 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "zWkETEGcMVY2Qq7f5Nehqw==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/transit_database/dimensions/.DS_Store"] will be destroyed
  # (because key ["models/intermediate/transit_database/dimensions/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1767728565953335 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fintermediate%2Ftransit_database%2Fdimensions%2F.DS_Store?generation=1767728565953335&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       output_name         = "data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fintermediate%2Ftransit_database%2Fdimensions%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/.DS_Store"] will be destroyed
  # (because key ["models/mart/gtfs/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1767728565955282 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2F.DS_Store?generation=1767728565955282&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       output_name         = "data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/mart/gtfs/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1288](https://github.com/cal-itp/data-infra/actions/runs/20761746764)